===================================================================================================================
Layer (type:depth-idx)                                            Output Shape              Param #
===================================================================================================================
SingleModel                                                       --                        --
├─PastModel: 1-1                                                  [1, 19]                   --
│    └─RepresentationModel: 2-1                                   [1, 31, 70]               --
│    │    └─RepresentationBlock: 3-1                              [1, 35, 31]               165,489
│    │    └─RepresentationBlock: 3-2                              [1, 35, 31]               24,011
│    │    └─RepresentationBlock: 3-3                              [1, 35, 31]               73,680
│    │    └─CombineRepresentation: 3-4                            [1, 31, 70]               35
│    └─PastHead2: 2-2                                             [1, 19]                   --
│    │    └─PastHead: 3-5                                         [1, 19]                   6,954
│    └─PastHead2: 2-3                                             [1, 54]                   --
│    │    └─PastHead: 3-6                                         [1, 54]                   19,764
├─LILSTMCell2: 1-2                                                [1, 19]                   --
│    └─LILSTMCell: 2-4                                            [1, 19]                   --
│    │    └─LSTMCell: 3-7                                         [1, 19]                   3,344
├─LILSTMCell2: 1-3                                                [1, 54]                   --
│    └─LILSTMCell: 2-5                                            [1, 54]                   --
│    │    └─LSTMCell: 3-8                                         [1, 54]                   17,064
├─CombineHead: 1-4                                                [1, 3]                    --
│    └─ResidualFC: 2-6                                            [1, 54]                   --
│    │    └─ResidualStack: 3-9                                    [1, 54]                   8,913
│    └─CombineRepresentation: 2-7                                 [1, 73]                   19
│    └─ResidualFC: 2-8                                            [1, 3]                    --
│    │    └─ResidualStack: 3-10                                   [1, 3]                    5,625
├─LILSTMCell2: 1-5                                                [1, 19]                   (recursive)
│    └─LILSTMCell: 2-9                                            [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-11                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-6                                                [1, 54]                   (recursive)
│    └─LILSTMCell: 2-10                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-12                                        [1, 54]                   (recursive)
├─CombineHead: 1-7                                                [1, 3]                    (recursive)
│    └─ResidualFC: 2-11                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-13                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-12                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-13                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-14                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-8                                                [1, 19]                   (recursive)
│    └─LILSTMCell: 2-14                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-15                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-9                                                [1, 54]                   (recursive)
│    └─LILSTMCell: 2-15                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-16                                        [1, 54]                   (recursive)
├─CombineHead: 1-10                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-16                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-17                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-17                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-18                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-18                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-11                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-19                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-19                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-12                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-20                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-20                                        [1, 54]                   (recursive)
├─CombineHead: 1-13                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-21                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-21                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-22                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-23                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-22                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-14                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-24                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-23                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-15                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-25                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-24                                        [1, 54]                   (recursive)
├─CombineHead: 1-16                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-26                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-25                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-27                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-28                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-26                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-17                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-29                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-27                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-18                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-30                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-28                                        [1, 54]                   (recursive)
├─CombineHead: 1-19                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-31                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-29                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-32                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-33                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-30                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-20                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-34                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-31                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-21                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-35                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-32                                        [1, 54]                   (recursive)
├─CombineHead: 1-22                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-36                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-33                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-37                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-38                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-34                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-23                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-39                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-35                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-24                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-40                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-36                                        [1, 54]                   (recursive)
├─CombineHead: 1-25                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-41                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-37                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-42                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-43                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-38                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-26                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-44                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-39                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-27                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-45                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-40                                        [1, 54]                   (recursive)
├─CombineHead: 1-28                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-46                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-41                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-47                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-48                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-42                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-29                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-49                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-43                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-30                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-50                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-44                                        [1, 54]                   (recursive)
├─CombineHead: 1-31                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-51                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-45                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-52                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-53                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-46                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-32                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-54                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-47                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-33                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-55                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-48                                        [1, 54]                   (recursive)
├─CombineHead: 1-34                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-56                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-49                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-57                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-58                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-50                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-35                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-59                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-51                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-36                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-60                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-52                                        [1, 54]                   (recursive)
├─CombineHead: 1-37                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-61                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-53                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-62                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-63                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-54                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-38                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-64                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-55                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-39                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-65                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-56                                        [1, 54]                   (recursive)
├─CombineHead: 1-40                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-66                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-57                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-67                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-68                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-58                                   [1, 3]                    (recursive)
├─LILSTMCell2: 1-41                                               [1, 19]                   (recursive)
│    └─LILSTMCell: 2-69                                           [1, 19]                   (recursive)
│    │    └─LSTMCell: 3-59                                        [1, 19]                   (recursive)
├─LILSTMCell2: 1-42                                               [1, 54]                   (recursive)
│    └─LILSTMCell: 2-70                                           [1, 54]                   (recursive)
│    │    └─LSTMCell: 3-60                                        [1, 54]                   (recursive)
├─CombineHead: 1-43                                               [1, 3]                    (recursive)
│    └─ResidualFC: 2-71                                           [1, 54]                   (recursive)
│    │    └─ResidualStack: 3-61                                   [1, 54]                   (recursive)
│    └─CombineRepresentation: 2-72                                [1, 73]                   (recursive)
│    └─ResidualFC: 2-73                                           [1, 3]                    (recursive)
│    │    └─ResidualStack: 3-62                                   [1, 3]                    (recursive)
===================================================================================================================
Total params: 324,733
Trainable params: 324,733
Non-trainable params: 0
Total mult-adds (M): 55.90
===================================================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 0.11
Params size (MB): 1.30
Estimated Total Size (MB): 1.42
===================================================================================================================